import {
  ArrowUpRight,
  Binoculars,
  CaretLeft,
  CaretRight,
  HandsPraying,
  House,
  NotePencil,
  Package,
  Truck,
} from "@phosphor-icons/react";
import styles from "./work.module.scss";
import { useState } from "react";

const Work: React.FC = () => {
  let [step, setStep] = useState<number>(0);

  const nextStep = () => {
    if (step < steps.length - 1) {
      setStep(step + 1);
    }
  };

  const backStep = () => {
    if (step > 0) {
      setStep(step - 1);
    }
  };
  const steps = [
    {
      icon: Binoculars,
      title: "Ознайомитеся з пропозиціями",
      pos: "stepPos1",
      subtitle:
        "Перегляньте наш каталог деталей для дронів і зброї, щоб знайти потрібні компоненти. Ми регулярно оновлюємо асортимент відповідно до актуальних потреб фронту.",
    },
    {
      icon: Package,
      title: "Додайте в передзамовлення",
      pos: "stepPos2",
      subtitle:
        "Залиште заявку на передзамовлення і ми повідомимо вас, щойно товар буде доступний до відправки.",
    },
    {
      icon: NotePencil,
      title: "Заповність форму",
      pos: "stepPos3",
      subtitle:
        "Залиште заявку на передзамовлення і ми повідомимо вас, щойно товар буде доступний до відправки.",
    },
    {
      icon: Truck,
      title: "Отримати посилку на НП",
      pos: "stepPos4",
      subtitle:
        "Перевірте посилку – перед відходом відкрийте та переконайтеся, що все на місці.",
    },
    {
      icon: HandsPraying,
      title: "Задонатити (якщо/коли буде можливість)",
      pos: "stepPos5",
      subtitle:
        "Оберіть спосіб донату – банківський переказ, PayPal, Patreon, криптовалюта або інші варіанти, які пропонує автор/проєкт.",
    },
  ];
  const Icon = steps[step].icon;
  const title = steps[step].title;
  const subtitle = steps[step].subtitle;

  return (
    <div className={styles.workContainer}>
      <h1>Як ми працюємо?</h1>
      <hr />
      <div className={styles.workContent}>
        <div className={styles.workContentWrapper}>
          <div className={`${styles.slider} ${styles.box}`}>
            <div className={styles.sliderHeader}>
              <div className={styles.sliderHeaderNavBox}>
                <div className={styles.sliderNav}>
                  <button onClick={() => backStep()}>
                    <CaretLeft
                      size={24}
                      weight="light"
                      color="rgba(90, 155, 239, 1)"
                    />
                  </button>
                  <button onClick={() => nextStep()}>
                    <CaretRight
                      size={24}
                      weight="light"
                      color="rgba(90, 155, 239, 1)"
                    />
                  </button>
                </div>
                <div className={styles.icon}>
                  <Icon
                    weight="fill"
                    color="#fff"
                    size={52}
                    className={styles.sliderIcon}
                  />
                </div>
              </div>
              <h3>{title}</h3>
              <p>{subtitle}</p>
            </div>
            <div>
              <button className={styles.bannerBtn}>
                <span>Переглянути категорії</span>
                <House
                  size={28}
                  weight="fill"
                  className={styles.bannerBtnHouseIcon}
                />
                <ArrowUpRight size={28} className={styles.bannerBtnArrowIcon} />
              </button>
            </div>
          </div>
          <div className={`${styles.devAndTesting} ${styles.box}`}>
            <h2>Розробка та тестування</h2>
            <p>
              Створюємо прототипи, випробовуємо їх у реальних умовах і
              вдосконалюємо до ідеального стану.
            </p>
            <div className={styles.steps}>
              <div className={styles.testingSteps}>
                <div className={styles.stepsVector}>
                  <svg
                    width="972"
                    height="428"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M4.6717 1.55082C195.744 1.17496 547.82 0.401754 735.336 0.0688477C768.212 0.305104 797.09 24.9187 800.827 55.922C805.878 92.0906 776.513 125.639 738.122 127.658C734.283 127.916 728.586 127.744 724.691 127.808C522.305 128.334 269.683 128.775 67.2752 129.398C24.4335 131.019 -3.81057 173.438 13.4258 210.863C23.6521 233.447 48.0457 247.193 73.7643 245.84C268.551 245.507 516.609 244.798 711.407 245.077C718.485 245.142 731.089 244.938 738.258 245.228C766.943 246.591 793.138 266.415 800.861 292.651C812.231 328.637 788.177 367.479 749.413 375.458C741.78 377.434 729.991 377.059 722.007 377.048C705.631 376.962 659.392 376.93 642.303 376.844C447.358 375.233 197.035 376.854 4.66038 372.57C234.384 370.647 505.239 369.498 735.2 368.918C764.86 368.575 790.873 346.281 794.112 318.284C797.362 294.841 783.727 270.539 761.326 260.101C752.097 255.612 741.655 253.636 731.327 253.926H724.679C522.169 254.173 269.491 253.615 66.9581 253.099C6.1326 250.2 -21.5678 180.397 22.7008 140.298C32.9157 131.191 46.1204 125.166 60.0046 123.33C64.41 122.664 69.291 122.654 73.7529 122.686C273.726 122.836 524.774 123.008 724.679 123.158H731.327C733.569 123.158 735.698 123.18 737.816 123.051C763.625 121.891 787.237 104.075 794.248 80.4818C806.082 43.0567 776.49 4.62215 735.234 3.90264C549.825 2.62471 191.621 4.49328 4.6717 1.55082Z"
                      fill="url(#paint0_radial_253_2010)"
                      transform="scale(1.2, 1.1)"
                    />
                    <defs>
                      <radialGradient
                        id="paint0_radial_253_2010"
                        cx="0"
                        cy="0"
                        r="1"
                        gradientUnits="userSpaceOnUse"
                        gradientTransform="translate(402.335 188.576) rotate(145.249) scale(488.483 769.023)"
                      >
                        <stop stopColor="#D4DDEC" />
                        <stop offset="0.959216" stop-color="#F9FAFD" />
                      </radialGradient>
                    </defs>
                  </svg>
                </div>

                <div className={styles.stepsVector_768}>
                  <svg
                    width="661"
                    height="166"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M606.061 0.95874C451.305 1.17507 160.738 1.67752 3.04796 1.92176C157.336 3.83385 452.96 2.6196 605.977 3.45003C640.025 3.91759 664.447 28.8933 654.68 53.2131C648.895 68.5447 629.408 80.1218 608.108 80.8755C606.36 80.9593 604.603 80.9453 602.752 80.9453H597.266C432.286 80.8476 225.097 80.736 60.0603 80.6383C56.3779 80.6173 52.3496 80.6243 48.7139 81.057C37.2554 82.2503 26.3576 86.1652 17.9273 92.0829C-18.6074 118.14 4.25364 163.5 54.4525 165.384C221.602 165.719 430.136 166.082 597.266 165.921H602.752C611.276 165.733 611 165.921 608.472 160.269C602.556 160.081 592.154 160.213 586.312 160.171C425.547 159.99 220.826 160.45 60.0696 160.667C38.8442 161.546 18.7123 152.614 10.2726 137.938C-3.9524 113.618 19.3572 86.0535 54.7142 84.9998C221.76 84.595 430.248 84.3089 597.276 83.967C600.491 83.9251 605.192 84.0367 608.36 83.8693C640.044 82.5573 664.279 60.7568 660.111 37.2535C657.026 17.1068 633.193 1.11227 606.061 0.95874Z"
                      fill="url(#paint0_radial_322_27363)"
                    />
                    <defs>
                      <radialGradient
                        id="paint0_radial_322_27363"
                        cx="0"
                        cy="0"
                        r="1"
                        gradientUnits="userSpaceOnUse"
                        gradientTransform="translate(330.289 83.4597) rotate(159.748) scale(352.052 384.306)"
                      >
                        <stop stop-color="#D4DDEC" />
                        <stop offset="0.959216" stop-color="#F9FAFD" />
                      </radialGradient>
                    </defs>
                  </svg>
                </div>
                <div className={styles.stepsVector_1024}>
                  <svg
                    width="496"
                    height="280"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M2.28204 1.10063C120.346 0.821482 337.896 0.247242 453.763 0C474.078 0.175462 491.922 18.4554 494.231 41.4808C497.352 68.3425 479.207 93.2581 455.485 94.7575C453.113 94.949 449.593 94.8213 447.186 94.8692C322.131 95.26 166.034 95.587 40.965 96.0496C14.4929 97.2539 -2.9592 128.757 7.69122 156.552C14.0101 173.325 29.083 183.533 44.9747 182.529C165.334 182.281 318.611 181.755 438.977 181.962C443.351 182.01 451.139 181.859 455.569 182.074C473.294 183.087 489.479 197.81 494.252 217.294C501.277 244.02 486.414 272.868 462.461 278.793C457.745 280.261 450.46 279.982 445.527 279.974C435.409 279.91 406.837 279.886 396.278 279.822C275.82 278.626 121.144 279.83 2.27504 276.648C144.222 275.22 311.585 274.367 453.679 273.936C472.006 273.681 488.08 257.124 490.081 236.332C492.09 218.921 483.664 200.872 469.823 193.12C464.12 189.786 457.668 188.319 451.286 188.534H447.179C322.047 188.718 165.915 188.303 40.7691 187.92C3.18474 185.767 -13.9315 133.925 13.4223 104.145C19.7342 97.3815 27.8934 92.9072 36.4726 91.5434C39.1946 91.0489 42.2106 91.0409 44.9677 91.0649C168.532 91.1765 323.656 91.3041 447.179 91.4158H451.286C452.672 91.4158 453.987 91.4317 455.296 91.336C471.243 90.4747 485.834 77.2432 490.165 59.7209C497.478 31.9261 479.193 3.38163 453.7 2.84727C339.135 1.89818 117.799 3.28593 2.28204 1.10063Z"
                      fill="url(#paint0_radial_322_26714)"
                    />
                    <defs>
                      <radialGradient
                        id="paint0_radial_322_26714"
                        cx="0"
                        cy="0"
                        r="1"
                        gradientUnits="userSpaceOnUse"
                        gradientTransform="translate(248 140) rotate(140.177) scale(322.904 533.873)"
                      >
                        <stop stop-color="#D4DDEC" />
                        <stop offset="0.959216" stop-color="#F9FAFD" />
                      </radialGradient>
                    </defs>
                  </svg>
                </div>
                <div className={styles.stepsVector_1440}>
                  <svg
                    width="804"
                    height="378"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M4.6717 1.55082C195.744 1.17496 547.82 0.401754 735.336 0.0688477C768.212 0.305104 797.09 24.9187 800.827 55.922C805.878 92.0906 776.513 125.639 738.122 127.658C734.283 127.916 728.586 127.744 724.691 127.808C522.305 128.334 269.683 128.775 67.2752 129.398C24.4335 131.019 -3.81057 173.438 13.4258 210.863C23.6521 233.447 48.0457 247.193 73.7643 245.84C268.551 245.507 516.609 244.798 711.407 245.077C718.485 245.142 731.089 244.938 738.258 245.228C766.943 246.591 793.138 266.415 800.861 292.651C812.231 328.637 788.177 367.479 749.413 375.458C741.78 377.434 729.991 377.059 722.007 377.048C705.631 376.962 659.392 376.93 642.303 376.844C447.358 375.233 197.035 376.854 4.66038 372.57C234.384 370.647 505.239 369.498 735.2 368.918C764.86 368.575 790.873 346.281 794.112 318.284C797.362 294.841 783.727 270.539 761.326 260.101C752.097 255.612 741.655 253.636 731.327 253.926H724.679C522.169 254.173 269.491 253.615 66.9581 253.099C6.1326 250.2 -21.5678 180.397 22.7008 140.298C32.9157 131.191 46.1204 125.166 60.0046 123.33C64.41 122.664 69.291 122.654 73.7529 122.686C273.726 122.836 524.774 123.008 724.679 123.158H731.327C733.569 123.158 735.698 123.18 737.816 123.051C763.625 121.891 787.237 104.075 794.248 80.4818C806.082 43.0567 776.49 4.62215 735.234 3.90264C549.825 2.62471 191.621 4.49328 4.6717 1.55082Z"
                      fill="url(#paint0_radial_322_26714)"
                    />
                    <defs>
                      <radialGradient
                        id="paint0_radial_253_2010"
                        cx="0"
                        cy="0"
                        r="1"
                        gradientUnits="userSpaceOnUse"
                        gradientTransform="translate(402.335 188.576) rotate(145.249) scale(488.483 769.023)"
                      >
                        <stop stop-color="#D4DDEC" />
                        <stop offset="0.959216" stop-color="#F9FAFD" />
                      </radialGradient>
                    </defs>
                  </svg>
                </div>
                <div className={styles.moving}></div>
                {steps.map(({ icon: Icon, title, pos }, index) => (
                  <div
                    key={index}
                    className={`${styles.step} ${styles[pos]} ${
                      step === index ? styles.active : ""
                    }`}
                  >
                    <Icon size={24} weight="fill" />
                    <h3>{title}</h3>
                  </div>
                ))}
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default Work;
